GopalSaraf/Practicals/PSDL/include/proc/pic16lf18346.inc
// Register: CWG2AS1
#define CWG2AS1 CWG2AS1
CWG2AS1                                  equ 0718h
// bitfield definitions
CWG2AS1_AS0E_POSN                        equ 0000h
CWG2AS1_AS0E_POSITION                    equ 0000h
CWG2AS1_AS0E_SIZE                        equ 0001h
CWG2AS1_AS0E_LENGTH                      equ 0001h
CWG2AS1_AS0E_MASK                        equ 0001h
CWG2AS1_AS1E_POSN                        equ 0001h
CWG2AS1_AS1E_POSITION                    equ 0001h
CWG2AS1_AS1E_SIZE                        equ 0001h
CWG2AS1_AS1E_LENGTH                      equ 0001h
CWG2AS1_AS1E_MASK                        equ 0002h
CWG2AS1_AS2E_POSN                        equ 0002h
CWG2AS1_AS2E_POSITION                    equ 0002h
CWG2AS1_AS2E_SIZE                        equ 0001h
CWG2AS1_AS2E_LENGTH                      equ 0001h
CWG2AS1_AS2E_MASK                        equ 0004h
CWG2AS1_AS3E_POSN                        equ 0003h
CWG2AS1_AS3E_POSITION                    equ 0003h
CWG2AS1_AS3E_SIZE                        equ 0001h
CWG2AS1_AS3E_LENGTH                      equ 0001h
CWG2AS1_AS3E_MASK                        equ 0008h
CWG2AS1_AS4E_POSN                        equ 0004h
CWG2AS1_AS4E_POSITION                    equ 0004h
CWG2AS1_AS4E_SIZE                        equ 0001h
CWG2AS1_AS4E_LENGTH                      equ 0001h
CWG2AS1_AS4E_MASK                        equ 0010h

// Register: CWG2STR
#define CWG2STR CWG2STR
CWG2STR                                  equ 0719h
// bitfield definitions
CWG2STR_STRA_POSN                        equ 0000h
CWG2STR_STRA_POSITION                    equ 0000h
CWG2STR_STRA_SIZE                        equ 0001h
CWG2STR_STRA_LENGTH                      equ 0001h
CWG2STR_STRA_MASK                        equ 0001h
CWG2STR_STRB_POSN                        equ 0001h
CWG2STR_STRB_POSITION                    equ 0001h
CWG2STR_STRB_SIZE                        equ 0001h
CWG2STR_STRB_LENGTH                      equ 0001h
CWG2STR_STRB_MASK                        equ 0002h
CWG2STR_STRC_POSN                        equ 0002h
CWG2STR_STRC_POSITION                    equ 0002h
CWG2STR_STRC_SIZE                        equ 0001h
CWG2STR_STRC_LENGTH                      equ 0001h
CWG2STR_STRC_MASK                        equ 0004h
CWG2STR_STRD_POSN                        equ 0003h
CWG2STR_STRD_POSITION                    equ 0003h
CWG2STR_STRD_SIZE                        equ 0001h
CWG2STR_STRD_LENGTH                      equ 0001h
CWG2STR_STRD_MASK                        equ 0008h
CWG2STR_OVRA_POSN                        equ 0004h
CWG2STR_OVRA_POSITION                    equ 0004h
CWG2STR_OVRA_SIZE                        equ 0001h
CWG2STR_OVRA_LENGTH                      equ 0001h
CWG2STR_OVRA_MASK                        equ 0010h
CWG2STR_OVRB_POSN                        equ 0005h
CWG2STR_OVRB_POSITION                    equ 0005h
CWG2STR_OVRB_SIZE                        equ 0001h
CWG2STR_OVRB_LENGTH                      equ 0001h
CWG2STR_OVRB_MASK                        equ 0020h
CWG2STR_OVRC_POSN                        equ 0006h
CWG2STR_OVRC_POSITION                    equ 0006h
CWG2STR_OVRC_SIZE                        equ 0001h
CWG2STR_OVRC_LENGTH                      equ 0001h
CWG2STR_OVRC_MASK                        equ 0040h
CWG2STR_OVRD_POSN                        equ 0007h
CWG2STR_OVRD_POSITION                    equ 0007h
CWG2STR_OVRD_SIZE                        equ 0001h
CWG2STR_OVRD_LENGTH                      equ 0001h
CWG2STR_OVRD_MASK                        equ 0080h
CWG2STR_CWG2STRA_POSN                    equ 0000h
CWG2STR_CWG2STRA_POSITION                equ 0000h
CWG2STR_CWG2STRA_SIZE                    equ 0001h
CWG2STR_CWG2STRA_LENGTH                  equ 0001h
CWG2STR_CWG2STRA_MASK                    equ 0001h
CWG2STR_CWG2STRB_POSN                    equ 0001h
CWG2STR_CWG2STRB_POSITION                equ 0001h
CWG2STR_CWG2STRB_SIZE                    equ 0001h
CWG2STR_CWG2STRB_LENGTH                  equ 0001h
CWG2STR_CWG2STRB_MASK                    equ 0002h
CWG2STR_CWG2STRC_POSN                    equ 0002h
CWG2STR_CWG2STRC_POSITION                equ 0002h
CWG2STR_CWG2STRC_SIZE                    equ 0001h
CWG2STR_CWG2STRC_LENGTH                  equ 0001h
CWG2STR_CWG2STRC_MASK                    equ 0004h
CWG2STR_CWG2STRD_POSN                    equ 0003h
CWG2STR_CWG2STRD_POSITION                equ 0003h
CWG2STR_CWG2STRD_SIZE                    equ 0001h
CWG2STR_CWG2STRD_LENGTH                  equ 0001h
CWG2STR_CWG2STRD_MASK                    equ 0008h
CWG2STR_CWG2OVRA_POSN                    equ 0004h
CWG2STR_CWG2OVRA_POSITION                equ 0004h
CWG2STR_CWG2OVRA_SIZE                    equ 0001h
CWG2STR_CWG2OVRA_LENGTH                  equ 0001h
CWG2STR_CWG2OVRA_MASK                    equ 0010h
CWG2STR_CWG2OVRB_POSN                    equ 0005h
CWG2STR_CWG2OVRB_POSITION                equ 0005h
CWG2STR_CWG2OVRB_SIZE                    equ 0001h
CWG2STR_CWG2OVRB_LENGTH                  equ 0001h
CWG2STR_CWG2OVRB_MASK                    equ 0020h
CWG2STR_CWG2OVRC_POSN                    equ 0006h
CWG2STR_CWG2OVRC_POSITION                equ 0006h
CWG2STR_CWG2OVRC_SIZE                    equ 0001h
CWG2STR_CWG2OVRC_LENGTH                  equ 0001h
CWG2STR_CWG2OVRC_MASK                    equ 0040h
CWG2STR_CWG2OVRD_POSN                    equ 0007h
CWG2STR_CWG2OVRD_POSITION                equ 0007h
CWG2STR_CWG2OVRD_SIZE                    equ 0001h
CWG2STR_CWG2OVRD_LENGTH                  equ 0001h
CWG2STR_CWG2OVRD_MASK                    equ 0080h

// Register: NVMADRL
#define NVMADRL NVMADRL
NVMADRL                                  equ 0891h
// bitfield definitions
NVMADRL_NVMADRL_POSN                     equ 0000h
NVMADRL_NVMADRL_POSITION                 equ 0000h
NVMADRL_NVMADRL_SIZE                     equ 0008h
NVMADRL_NVMADRL_LENGTH                   equ 0008h
NVMADRL_NVMADRL_MASK                     equ 00FFh
NVMADRL_NVMADR0_POSN                     equ 0000h
NVMADRL_NVMADR0_POSITION                 equ 0000h
NVMADRL_NVMADR0_SIZE                     equ 0001h
NVMADRL_NVMADR0_LENGTH                   equ 0001h
NVMADRL_NVMADR0_MASK                     equ 0001h
NVMADRL_NVMADR1_POSN                     equ 0001h
NVMADRL_NVMADR1_POSITION                 equ 0001h
NVMADRL_NVMADR1_SIZE                     equ 0001h
NVMADRL_NVMADR1_LENGTH                   equ 0001h
NVMADRL_NVMADR1_MASK                     equ 0002h
NVMADRL_NVMADR2_POSN                     equ 0002h
NVMADRL_NVMADR2_POSITION                 equ 0002h
NVMADRL_NVMADR2_SIZE                     equ 0001h
NVMADRL_NVMADR2_LENGTH                   equ 0001h
NVMADRL_NVMADR2_MASK                     equ 0004h
NVMADRL_NVMADR3_POSN                     equ 0003h
NVMADRL_NVMADR3_POSITION                 equ 0003h
NVMADRL_NVMADR3_SIZE                     equ 0001h
NVMADRL_NVMADR3_LENGTH                   equ 0001h
NVMADRL_NVMADR3_MASK                     equ 0008h
NVMADRL_NVMADR4_POSN                     equ 0004h
NVMADRL_NVMADR4_POSITION                 equ 0004h
NVMADRL_NVMADR4_SIZE                     equ 0001h
NVMADRL_NVMADR4_LENGTH                   equ 0001h
NVMADRL_NVMADR4_MASK                     equ 0010h
NVMADRL_NVMADR5_POSN                     equ 0005h
NVMADRL_NVMADR5_POSITION                 equ 0005h
NVMADRL_NVMADR5_SIZE                     equ 0001h
NVMADRL_NVMADR5_LENGTH                   equ 0001h
NVMADRL_NVMADR5_MASK                     equ 0020h
NVMADRL_NVMADR6_POSN                     equ 0006h
NVMADRL_NVMADR6_POSITION                 equ 0006h
NVMADRL_NVMADR6_SIZE                     equ 0001h
NVMADRL_NVMADR6_LENGTH                   equ 0001h
NVMADRL_NVMADR6_MASK                     equ 0040h
NVMADRL_NVMADR7_POSN                     equ 0007h
NVMADRL_NVMADR7_POSITION                 equ 0007h
NVMADRL_NVMADR7_SIZE                     equ 0001h
NVMADRL_NVMADR7_LENGTH                   equ 0001h
NVMADRL_NVMADR7_MASK                     equ 0080h
NVMADRL_EEADRL_POSN                      equ 0000h
NVMADRL_EEADRL_POSITION                  equ 0000h
NVMADRL_EEADRL_SIZE                      equ 0008h
NVMADRL_EEADRL_LENGTH                    equ 0008h
NVMADRL_EEADRL_MASK                      equ 00FFh
NVMADRL_PMADRL_POSN                      equ 0000h
NVMADRL_PMADRL_POSITION                  equ 0000h
NVMADRL_PMADRL_SIZE                      equ 0008h
NVMADRL_PMADRL_LENGTH                    equ 0008h
NVMADRL_PMADRL_MASK                      equ 00FFh

