GopalSaraf/Practicals/PSDL/include/proc/pic16lf18346.inc
// Register: CWG2PPS
#define CWG2PPS CWG2PPS
CWG2PPS                                  equ 0E19h
// bitfield definitions
CWG2PPS_CWG2PPS_POSN                     equ 0000h
CWG2PPS_CWG2PPS_POSITION                 equ 0000h
CWG2PPS_CWG2PPS_SIZE                     equ 0005h
CWG2PPS_CWG2PPS_LENGTH                   equ 0005h
CWG2PPS_CWG2PPS_MASK                     equ 001Fh
CWG2PPS_CWG2PPS0_POSN                    equ 0000h
CWG2PPS_CWG2PPS0_POSITION                equ 0000h
CWG2PPS_CWG2PPS0_SIZE                    equ 0001h
CWG2PPS_CWG2PPS0_LENGTH                  equ 0001h
CWG2PPS_CWG2PPS0_MASK                    equ 0001h
CWG2PPS_CWG2PPS1_POSN                    equ 0001h
CWG2PPS_CWG2PPS1_POSITION                equ 0001h
CWG2PPS_CWG2PPS1_SIZE                    equ 0001h
CWG2PPS_CWG2PPS1_LENGTH                  equ 0001h
CWG2PPS_CWG2PPS1_MASK                    equ 0002h
CWG2PPS_CWG2PPS2_POSN                    equ 0002h
CWG2PPS_CWG2PPS2_POSITION                equ 0002h
CWG2PPS_CWG2PPS2_SIZE                    equ 0001h
CWG2PPS_CWG2PPS2_LENGTH                  equ 0001h
CWG2PPS_CWG2PPS2_MASK                    equ 0004h
CWG2PPS_CWG2PPS3_POSN                    equ 0003h
CWG2PPS_CWG2PPS3_POSITION                equ 0003h
CWG2PPS_CWG2PPS3_SIZE                    equ 0001h
CWG2PPS_CWG2PPS3_LENGTH                  equ 0001h
CWG2PPS_CWG2PPS3_MASK                    equ 0008h
CWG2PPS_CWG2PPS4_POSN                    equ 0004h
CWG2PPS_CWG2PPS4_POSITION                equ 0004h
CWG2PPS_CWG2PPS4_SIZE                    equ 0001h
CWG2PPS_CWG2PPS4_LENGTH                  equ 0001h
CWG2PPS_CWG2PPS4_MASK                    equ 0010h

// Register: MDCIN1PPS
#define MDCIN1PPS MDCIN1PPS
MDCIN1PPS                                equ 0E1Ah
// bitfield definitions
MDCIN1PPS_MDCIN1PPS_POSN                 equ 0000h
MDCIN1PPS_MDCIN1PPS_POSITION             equ 0000h
MDCIN1PPS_MDCIN1PPS_SIZE                 equ 0005h
MDCIN1PPS_MDCIN1PPS_LENGTH               equ 0005h
MDCIN1PPS_MDCIN1PPS_MASK                 equ 001Fh
MDCIN1PPS_MDCIN1PPS0_POSN                equ 0000h
MDCIN1PPS_MDCIN1PPS0_POSITION            equ 0000h
MDCIN1PPS_MDCIN1PPS0_SIZE                equ 0001h
MDCIN1PPS_MDCIN1PPS0_LENGTH              equ 0001h
MDCIN1PPS_MDCIN1PPS0_MASK                equ 0001h
MDCIN1PPS_MDCIN1PPS1_POSN                equ 0001h
MDCIN1PPS_MDCIN1PPS1_POSITION            equ 0001h
MDCIN1PPS_MDCIN1PPS1_SIZE                equ 0001h
MDCIN1PPS_MDCIN1PPS1_LENGTH              equ 0001h
MDCIN1PPS_MDCIN1PPS1_MASK                equ 0002h
MDCIN1PPS_MDCIN1PPS2_POSN                equ 0002h
MDCIN1PPS_MDCIN1PPS2_POSITION            equ 0002h
MDCIN1PPS_MDCIN1PPS2_SIZE                equ 0001h
MDCIN1PPS_MDCIN1PPS2_LENGTH              equ 0001h
MDCIN1PPS_MDCIN1PPS2_MASK                equ 0004h
MDCIN1PPS_MDCIN1PPS3_POSN                equ 0003h
MDCIN1PPS_MDCIN1PPS3_POSITION            equ 0003h
MDCIN1PPS_MDCIN1PPS3_SIZE                equ 0001h
MDCIN1PPS_MDCIN1PPS3_LENGTH              equ 0001h
MDCIN1PPS_MDCIN1PPS3_MASK                equ 0008h
MDCIN1PPS_MDCIN1PPS4_POSN                equ 0004h
MDCIN1PPS_MDCIN1PPS4_POSITION            equ 0004h
MDCIN1PPS_MDCIN1PPS4_SIZE                equ 0001h
MDCIN1PPS_MDCIN1PPS4_LENGTH              equ 0001h
MDCIN1PPS_MDCIN1PPS4_MASK                equ 0010h

// Register: MDCIN2PPS
#define MDCIN2PPS MDCIN2PPS
MDCIN2PPS                                equ 0E1Bh
// bitfield definitions
MDCIN2PPS_MDCIN2PPS_POSN                 equ 0000h
MDCIN2PPS_MDCIN2PPS_POSITION             equ 0000h
MDCIN2PPS_MDCIN2PPS_SIZE                 equ 0005h
MDCIN2PPS_MDCIN2PPS_LENGTH               equ 0005h
MDCIN2PPS_MDCIN2PPS_MASK                 equ 001Fh
MDCIN2PPS_MDCIN2PPS0_POSN                equ 0000h
MDCIN2PPS_MDCIN2PPS0_POSITION            equ 0000h
MDCIN2PPS_MDCIN2PPS0_SIZE                equ 0001h
MDCIN2PPS_MDCIN2PPS0_LENGTH              equ 0001h
MDCIN2PPS_MDCIN2PPS0_MASK                equ 0001h
MDCIN2PPS_MDCIN2PPS1_POSN                equ 0001h
MDCIN2PPS_MDCIN2PPS1_POSITION            equ 0001h
MDCIN2PPS_MDCIN2PPS1_SIZE                equ 0001h
MDCIN2PPS_MDCIN2PPS1_LENGTH              equ 0001h
MDCIN2PPS_MDCIN2PPS1_MASK                equ 0002h
MDCIN2PPS_MDCIN2PPS2_POSN                equ 0002h
MDCIN2PPS_MDCIN2PPS2_POSITION            equ 0002h
MDCIN2PPS_MDCIN2PPS2_SIZE                equ 0001h
MDCIN2PPS_MDCIN2PPS2_LENGTH              equ 0001h
MDCIN2PPS_MDCIN2PPS2_MASK                equ 0004h
MDCIN2PPS_MDCIN2PPS3_POSN                equ 0003h
MDCIN2PPS_MDCIN2PPS3_POSITION            equ 0003h
MDCIN2PPS_MDCIN2PPS3_SIZE                equ 0001h
MDCIN2PPS_MDCIN2PPS3_LENGTH              equ 0001h
MDCIN2PPS_MDCIN2PPS3_MASK                equ 0008h
MDCIN2PPS_MDCIN2PPS4_POSN                equ 0004h
MDCIN2PPS_MDCIN2PPS4_POSITION            equ 0004h
MDCIN2PPS_MDCIN2PPS4_SIZE                equ 0001h
MDCIN2PPS_MDCIN2PPS4_LENGTH              equ 0001h
MDCIN2PPS_MDCIN2PPS4_MASK                equ 0010h

// Register: MDMINPPS
#define MDMINPPS MDMINPPS
MDMINPPS                                 equ 0E1Ch
// bitfield definitions
MDMINPPS_MDMINPPS_POSN                   equ 0000h
MDMINPPS_MDMINPPS_POSITION               equ 0000h
MDMINPPS_MDMINPPS_SIZE                   equ 0005h
MDMINPPS_MDMINPPS_LENGTH                 equ 0005h
MDMINPPS_MDMINPPS_MASK                   equ 001Fh
MDMINPPS_MDMINPPS0_POSN                  equ 0000h
MDMINPPS_MDMINPPS0_POSITION              equ 0000h
MDMINPPS_MDMINPPS0_SIZE                  equ 0001h
MDMINPPS_MDMINPPS0_LENGTH                equ 0001h
MDMINPPS_MDMINPPS0_MASK                  equ 0001h
MDMINPPS_MDMINPPS1_POSN                  equ 0001h
MDMINPPS_MDMINPPS1_POSITION              equ 0001h
MDMINPPS_MDMINPPS1_SIZE                  equ 0001h
MDMINPPS_MDMINPPS1_LENGTH                equ 0001h
MDMINPPS_MDMINPPS1_MASK                  equ 0002h
MDMINPPS_MDMINPPS2_POSN                  equ 0002h
MDMINPPS_MDMINPPS2_POSITION              equ 0002h
MDMINPPS_MDMINPPS2_SIZE                  equ 0001h
MDMINPPS_MDMINPPS2_LENGTH                equ 0001h
MDMINPPS_MDMINPPS2_MASK                  equ 0004h
MDMINPPS_MDMINPPS3_POSN                  equ 0003h
MDMINPPS_MDMINPPS3_POSITION              equ 0003h
MDMINPPS_MDMINPPS3_SIZE                  equ 0001h
MDMINPPS_MDMINPPS3_LENGTH                equ 0001h
MDMINPPS_MDMINPPS3_MASK                  equ 0008h
MDMINPPS_MDMINPPS4_POSN                  equ 0004h
MDMINPPS_MDMINPPS4_POSITION              equ 0004h
MDMINPPS_MDMINPPS4_SIZE                  equ 0001h
MDMINPPS_MDMINPPS4_LENGTH                equ 0001h
MDMINPPS_MDMINPPS4_MASK                  equ 0010h

// Register: SSP2CLKPPS
#define SSP2CLKPPS SSP2CLKPPS
SSP2CLKPPS                               equ 0E1Dh
// bitfield definitions
SSP2CLKPPS_SSP2CLKPPS_POSN               equ 0000h
SSP2CLKPPS_SSP2CLKPPS_POSITION           equ 0000h
SSP2CLKPPS_SSP2CLKPPS_SIZE               equ 0005h
SSP2CLKPPS_SSP2CLKPPS_LENGTH             equ 0005h
SSP2CLKPPS_SSP2CLKPPS_MASK               equ 001Fh
SSP2CLKPPS_SSP2CLKPPS0_POSN              equ 0000h
SSP2CLKPPS_SSP2CLKPPS0_POSITION          equ 0000h
SSP2CLKPPS_SSP2CLKPPS0_SIZE              equ 0001h
SSP2CLKPPS_SSP2CLKPPS0_LENGTH            equ 0001h
SSP2CLKPPS_SSP2CLKPPS0_MASK              equ 0001h
SSP2CLKPPS_SSP2CLKPPS1_POSN              equ 0001h
SSP2CLKPPS_SSP2CLKPPS1_POSITION          equ 0001h
SSP2CLKPPS_SSP2CLKPPS1_SIZE              equ 0001h
SSP2CLKPPS_SSP2CLKPPS1_LENGTH            equ 0001h
SSP2CLKPPS_SSP2CLKPPS1_MASK              equ 0002h
SSP2CLKPPS_SSP2CLKPPS2_POSN              equ 0002h
SSP2CLKPPS_SSP2CLKPPS2_POSITION          equ 0002h
SSP2CLKPPS_SSP2CLKPPS2_SIZE              equ 0001h
SSP2CLKPPS_SSP2CLKPPS2_LENGTH            equ 0001h
SSP2CLKPPS_SSP2CLKPPS2_MASK              equ 0004h
SSP2CLKPPS_SSP2CLKPPS3_POSN              equ 0003h
SSP2CLKPPS_SSP2CLKPPS3_POSITION          equ 0003h
SSP2CLKPPS_SSP2CLKPPS3_SIZE              equ 0001h
SSP2CLKPPS_SSP2CLKPPS3_LENGTH            equ 0001h
SSP2CLKPPS_SSP2CLKPPS3_MASK              equ 0008h
SSP2CLKPPS_SSP2CLKPPS4_POSN              equ 0004h
SSP2CLKPPS_SSP2CLKPPS4_POSITION          equ 0004h
SSP2CLKPPS_SSP2CLKPPS4_SIZE              equ 0001h
SSP2CLKPPS_SSP2CLKPPS4_LENGTH            equ 0001h
SSP2CLKPPS_SSP2CLKPPS4_MASK              equ 0010h

// Register: SSP2DATPPS
#define SSP2DATPPS SSP2DATPPS
SSP2DATPPS                               equ 0E1Eh
// bitfield definitions
SSP2DATPPS_SSP2DATPPS_POSN               equ 0000h
SSP2DATPPS_SSP2DATPPS_POSITION           equ 0000h
SSP2DATPPS_SSP2DATPPS_SIZE               equ 0005h
SSP2DATPPS_SSP2DATPPS_LENGTH             equ 0005h
SSP2DATPPS_SSP2DATPPS_MASK               equ 001Fh
SSP2DATPPS_SSP2DATPPS0_POSN              equ 0000h
SSP2DATPPS_SSP2DATPPS0_POSITION          equ 0000h
SSP2DATPPS_SSP2DATPPS0_SIZE              equ 0001h
SSP2DATPPS_SSP2DATPPS0_LENGTH            equ 0001h
SSP2DATPPS_SSP2DATPPS0_MASK              equ 0001h
SSP2DATPPS_SSP2DATPPS1_POSN              equ 0001h
SSP2DATPPS_SSP2DATPPS1_POSITION          equ 0001h
SSP2DATPPS_SSP2DATPPS1_SIZE              equ 0001h
SSP2DATPPS_SSP2DATPPS1_LENGTH            equ 0001h
SSP2DATPPS_SSP2DATPPS1_MASK              equ 0002h
SSP2DATPPS_SSP2DATPPS2_POSN              equ 0002h
SSP2DATPPS_SSP2DATPPS2_POSITION          equ 0002h
SSP2DATPPS_SSP2DATPPS2_SIZE              equ 0001h
SSP2DATPPS_SSP2DATPPS2_LENGTH            equ 0001h
SSP2DATPPS_SSP2DATPPS2_MASK              equ 0004h
SSP2DATPPS_SSP2DATPPS3_POSN              equ 0003h
SSP2DATPPS_SSP2DATPPS3_POSITION          equ 0003h
SSP2DATPPS_SSP2DATPPS3_SIZE              equ 0001h
SSP2DATPPS_SSP2DATPPS3_LENGTH            equ 0001h
SSP2DATPPS_SSP2DATPPS3_MASK              equ 0008h
SSP2DATPPS_SSP2DATPPS4_POSN              equ 0004h
SSP2DATPPS_SSP2DATPPS4_POSITION          equ 0004h
SSP2DATPPS_SSP2DATPPS4_SIZE              equ 0001h
SSP2DATPPS_SSP2DATPPS4_LENGTH            equ 0001h
SSP2DATPPS_SSP2DATPPS4_MASK              equ 0010h

// Register: SSP2SSPPS
#define SSP2SSPPS SSP2SSPPS
SSP2SSPPS                                equ 0E1Fh
// bitfield definitions
SSP2SSPPS_SSP2SSPPS_POSN                 equ 0000h
SSP2SSPPS_SSP2SSPPS_POSITION             equ 0000h
SSP2SSPPS_SSP2SSPPS_SIZE                 equ 0005h
SSP2SSPPS_SSP2SSPPS_LENGTH               equ 0005h
SSP2SSPPS_SSP2SSPPS_MASK                 equ 001Fh
SSP2SSPPS_SSP2SSPPS0_POSN                equ 0000h
SSP2SSPPS_SSP2SSPPS0_POSITION            equ 0000h
SSP2SSPPS_SSP2SSPPS0_SIZE                equ 0001h
SSP2SSPPS_SSP2SSPPS0_LENGTH              equ 0001h
SSP2SSPPS_SSP2SSPPS0_MASK                equ 0001h
SSP2SSPPS_SSP2SSPPS1_POSN                equ 0001h
SSP2SSPPS_SSP2SSPPS1_POSITION            equ 0001h
SSP2SSPPS_SSP2SSPPS1_SIZE                equ 0001h
SSP2SSPPS_SSP2SSPPS1_LENGTH              equ 0001h
SSP2SSPPS_SSP2SSPPS1_MASK                equ 0002h
SSP2SSPPS_SSP2SSPPS2_POSN                equ 0002h
SSP2SSPPS_SSP2SSPPS2_POSITION            equ 0002h
SSP2SSPPS_SSP2SSPPS2_SIZE                equ 0001h
SSP2SSPPS_SSP2SSPPS2_LENGTH              equ 0001h
SSP2SSPPS_SSP2SSPPS2_MASK                equ 0004h
SSP2SSPPS_SSP2SSPPS3_POSN                equ 0003h
SSP2SSPPS_SSP2SSPPS3_POSITION            equ 0003h
SSP2SSPPS_SSP2SSPPS3_SIZE                equ 0001h
SSP2SSPPS_SSP2SSPPS3_LENGTH              equ 0001h
SSP2SSPPS_SSP2SSPPS3_MASK                equ 0008h
SSP2SSPPS_SSP2SSPPS4_POSN                equ 0004h
SSP2SSPPS_SSP2SSPPS4_POSITION            equ 0004h
SSP2SSPPS_SSP2SSPPS4_SIZE                equ 0001h
SSP2SSPPS_SSP2SSPPS4_LENGTH              equ 0001h
SSP2SSPPS_SSP2SSPPS4_MASK                equ 0010h

